{
  "backend/main.mo": "Main Motoko actor managing photos, albums, user profiles, access control, and upload operations, with caption-ready photo type and helper functions.",
  "backend/migration.mo": "Migration module converting old photo records to new format by adding a caption field initialized to null.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing short summaries for all frontend source files and checkpoint documents.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and theme rules for light and dark modes.",
  "frontend/index.html": "HTML entry point wiring the app root and including the generated old‑camera favicon.",
  "frontend/PHOTO_APP_STAGE_2_ALBUMS.checkpoint.md": "Checkpoint documentation describing completion of the Albums feature and its backend integration.",
  "frontend/PHOTO_APP_STAGE_3_SEARCH.checkpoint.md": "Checkpoint document outlining completed search, caption, and favicon features with technical details.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile loading, and conditional rendering of HomeScreen or SignInScreen.",
  "frontend/src/components/AlbumActionsDialog.tsx": "Modal for creating, renaming, or deleting an album using mutation hooks with pending state handling.",
  "frontend/src/components/AlbumCard.tsx": "Displays an album preview card with cover photo and photo count, loading the cover via a query.",
  "frontend/src/components/AlbumCoverPhotoDialog.tsx": "Dialog to choose and set an album's cover photo, fetching paginated photos and submitting the selection.",
  "frontend/src/components/AlbumPhotoGridItem.tsx": "Grid item for an album photo with hover-to-remove button and click handler.",
  "frontend/src/components/PendingUploadPreview.tsx": "Shows thumbnails of pending uploads with options to remove individual items or clear all.",
  "frontend/src/components/PhotoGrid.tsx": "Renders a responsive grid of photos where each item triggers a click callback with its index.",
  "frontend/src/components/PhotoPickerDialog.tsx": "Dialog for selecting photos from the library to add to an album, using paginated fetch and multi-select.",
  "frontend/src/components/PhotoViewer.tsx": "Fullscreen photo viewer with navigation, caption editing, and photo deletion support.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal prompting user for their name and saving the profile via mutation.",
  "frontend/src/components/UploadButton.tsx": "File upload button managing previews, progress, and batch photo upload using useUploadPhotos.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity loading using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for profiles, photos, albums, and mutations interacting with the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and theme variables defining light and dark color palettes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers around the app.",
  "frontend/src/screens/AlbumDetailScreen.tsx": "Album detail view showing album info, photos, actions, pagination, and photo viewer dialogs.",
  "frontend/src/screens/AlbumsScreen.tsx": "Displays album list with search filtering, allows creating albums, and navigates to album details.",
  "frontend/src/screens/HomeScreen.tsx": "Shows photo library with search, pagination, uploads, tab switching, and full-screen viewing.",
  "frontend/src/screens/SignInScreen.tsx": "Provides a simple Internet Identity sign‑in UI with loading state.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters and session values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, themes, animations, and plugins.",
  "project_state.json": "Describes project state, requirements, existing features, and architectural notes for the Photo Library app."
}