{
  "backend/main.mo": "Motoko backend managing user profiles, photos, and albums with access control, blob storage, and CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping implemented album features to files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short summaries describing each component or screen.",
  "frontend/index.css": "Tailwind-based global styles defining color variables, dark mode, and base typography.",
  "frontend/index.html": "HTML entry point setting up root element and loading the main React script.",
  "frontend/PHOTO_APP_STAGE_2_ALBUMS.checkpoint.md": "Checkpoint document outlining completed album features, UI flow, and backend integration.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile setup, and rendering HomeScreen.",
  "frontend/src/components/AlbumActionsDialog.tsx": "Dialog component for creating, renaming, and deleting albums with async mutations.",
  "frontend/src/components/AlbumCard.tsx": "Album card showing cover image, name, and photo count, using first photo as the cover.",
  "frontend/src/components/AlbumPhotoGridItem.tsx": "Renders a square photo thumbnail with hover-based remove button and click handling.",
  "frontend/src/components/PendingUploadPreview.tsx": "Displays pending image uploads with previews and controls to remove individual or all files.",
  "frontend/src/components/PhotoGrid.tsx": "Shows a responsive grid of photos where each item triggers a click callback with its index.",
  "frontend/src/components/PhotoPickerDialog.tsx": "Modal for selecting photos from a paginated list to add to an album, with selection state and add action.",
  "frontend/src/components/PhotoViewer.tsx": "Full-screen photo viewer supporting navigation, keyboard controls, and photo deletion.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting the user to enter and save their name via a profile save mutation.",
  "frontend/src/components/UploadButton.tsx": "Handles selecting image files, generating previews, tracking upload progress, and uploading photos.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on authentication state, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login state and persisted identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, photos, and album data through a backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables for light and dark modes and global styles.",
  "frontend/src/main.tsx": "Entry point that sets up React, React Query, and the Internet Identity provider before rendering the app.",
  "frontend/src/screens/AlbumDetailScreen.tsx": "Displays album details with photo grid, photo viewer, and actions for adding, removing, or modifying photos and album metadata.",
  "frontend/src/screens/AlbumsScreen.tsx": "Shows the list of albums with loading states, creation dialog, and navigation into album detail views.",
  "frontend/src/screens/HomeScreen.tsx": "Main screen with tabs for photo library and albums, handling photo viewing, uploads, user info, and sign‑out.",
  "frontend/src/screens/SignInScreen.tsx": "Simple sign‑in screen that triggers Internet Identity login with loading feedback.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning hash parameters for routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and plugin setup.",
  "project_state.json": "JSON record of the project’s current state, requirements, features, and architectural notes for a photo library app."
}