{
  "backend/main.mo": "Main Motoko actor handling auth, user profiles, and per-user photo storage with upload and listing logic.",
  "backend/migration.mo": "Migration module defining legacy Photo and Actor types and returning the old state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-style list describing high-level summaries of all major frontend files.",
  "frontend/index.css": "Tailwind base plus custom OKLCH color variables for light/dark themes and global styling.",
  "frontend/index.html": "Basic HTML shell containing root div and script entry for the React app.",
  "frontend/src/App.tsx": "Root app component managing auth flow, profile loading, and conditional display of HomeScreen or SignInScreen.",
  "frontend/src/components/PendingUploadPreview.tsx": "Grid preview of pending uploads with remove and clear-all actions and disabled states.",
  "frontend/src/components/PhotoGrid.tsx": "Responsive grid of photo thumbnails that triggers a click handler to open the viewer.",
  "frontend/src/components/PhotoViewer.tsx": "Full-screen photo viewer with navigation, deletion, keyboard shortcuts, and responsive UI.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog prompting first-time users to save a name and submit their profile.",
  "frontend/src/components/UploadButton.tsx": "Handles file selection, preview, and uploading photos with progress and error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the current identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, and logout using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, paginated photos, uploading, and deleting photos via the actor.",
  "frontend/src/index.css": "Configures Tailwind and defines light/dark theme variables for global styling.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/screens/HomeScreen.tsx": "Main app screen showing header, upload button, photo grid, and viewer with pagination and sign-out logic.",
  "frontend/src/screens/SignInScreen.tsx": "Displays a sign‑in UI and triggers Internet Identity login.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and optionally clean them from the hash.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color tokens, animations, and extra plugins.",
  "project_state.json": "JSON describing project state, requirements, and known issues for a mobile‑first photo gallery app."
}