{
  "kind": "build_request",
  "title": "Fix upload replacing existing photos; add accumulating pre-upload preview",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Fix backend photo upload so calling uploadMultiplePhotos appends the newly uploaded photos to the caller’s existing stored photo list instead of replacing/removing previously stored photos.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-8"
        ],
        "quotes": [
          "But it deletes the picture I uploaded and then uploads the other picture. So I can't add to this collection.",
          "for 1), I meant it is removed from the stored gallery I assume."
        ]
      },
      "acceptanceCriteria": [
        "Given a user with existing stored photos, calling uploadMultiplePhotos with one or more new photos results in the user having all prior photos plus the newly uploaded photos (no prior photo is removed).",
        "After uploadMultiplePhotos completes, getAllPhotosPaginated returns the newly uploaded photos at the top (newest-first) while retaining previously uploaded photos in the list.",
        "No changes are made that allow one user to append to or read another user’s photos (caller scoping remains enforced)."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Update the upload UI/flow so selecting photos multiple times adds to an accumulating “pending upload” selection (does not replace prior pending selections), and display previews of all pending photos before the user performs the upload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "Yes",
          "Yes, show all the photos before upload."
        ]
      },
      "acceptanceCriteria": [
        "When the user selects images from the file picker, the app shows thumbnail previews for all currently pending images (including those selected in earlier picker sessions).",
        "Selecting additional images later adds them to the pending preview list rather than replacing the previous pending previews.",
        "The user can clearly see how many photos are pending before upload, and the UI remains mobile-first and minimal.",
        "All user-facing text related to this flow is in English."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Ensure the upload action only uploads the currently pending selection, clears the pending preview list on successful upload, and does not remove any previously uploaded photos from the gallery UI or stored backend state.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "I want to be able to add to the collection of pictures I have and keep the ones I've uploaded already.",
          "Do you want the upload button to always add photos to your existing gallery, even if you select just one new file? 2) Yes"
        ]
      },
      "acceptanceCriteria": [
        "After a successful upload, the pending preview list is cleared and the gallery grid still shows all photos that were previously uploaded plus the new ones.",
        "After a failed upload, the pending preview list remains intact so the user can retry without re-selecting files, and the existing gallery remains unchanged.",
        "Uploading multiple times in a row (select → upload → select → upload) only ever increases the stored photo count unless the user explicitly deletes photos via the existing Delete action.",
        "The existing basic upload failure message behavior remains (English), and no new error messaging is introduced that contradicts it."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if a state upgrade is actually required.",
    "Do not edit any frontend files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any sources inside frontend/src/components/ui (compose instead).",
    "Keep the app mobile-first and minimal; ensure interactions remain fast and simple."
  ],
  "nonGoals": [
    "Do not add albums, tags, AI search, sharing, or any other organizational features.",
    "Do not add third-party authentication providers beyond Internet Identity.",
    "Do not add external databases or additional backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}