{
  "kind": "build_request",
  "title": "Add local search on Home, per-photo captions, and a generated favicon",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Extend the backend photo data model to persist an optional per-photo caption for each user, and expose an authorized API to update (set/clear) the caption for a specific photo owned by the caller.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add Search.\n\nRequirements:\n- Search bar on Home.\n- Search matches album names + photo captions + filename (if available).\n- Add an editable caption field per photo.\n\nNo AI. Keep it fast and simple."
        ]
      },
      "acceptanceCriteria": [
        "Backend Photo type includes a caption field (optional) that is returned by existing list/get photo APIs.",
        "A new authenticated update method exists to set or clear a photo caption for a caller-owned photo; unauthorized access traps as with existing photo APIs.",
        "Updating a caption does not change photo ordering and does not affect album membership.",
        "If the project supports upgrades with persisted state, existing stored photos are upgraded with caption initialized to empty/none without data loss (update conditional migration logic if applicable)."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Add an editable caption UI in the full-screen photo viewer that lets the user view and edit the current photo’s caption, saving it to the backend and updating the UI state accordingly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1) Full-screen viewer\n2) Yes"
        ]
      },
      "acceptanceCriteria": [
        "PhotoViewer shows a caption field for the currently viewed photo with clear English labeling (e.g., \"Caption\").",
        "User can edit the caption and save; a loading/disabled state is shown during save, and failures show a simple English error message.",
        "On successful save, the viewer displays the updated caption for the photo without requiring a full page refresh.",
        "Relevant React Query caches are invalidated/updated so the Home grid data used for local search reflects the new caption (e.g., invalidate ['allPhotos'] and any per-photo query keys used)."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Implement a fast, non-AI search bar on the Home screen header that locally filters already-loaded data: in the Library tab, filter photos by caption text and filename/name (when available); in the Albums tab, filter albums by album name.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Search bar on Home.",
          "Search matches album names + photo captions + filename (if available).",
          "No AI. Keep it fast and simple.",
          "3) filter the existing photo"
        ]
      },
      "acceptanceCriteria": [
        "Home screen renders a search input in the authenticated experience with English placeholder text (e.g., \"Search\").",
        "Search filtering is local-only (no new backend search endpoints) and operates on the currently loaded pages of photos/albums.",
        "Library tab: photo grid updates to only show photos whose caption or name/filename contains the search query (case-insensitive).",
        "Albums tab: album list updates to only show albums whose name contains the search query (case-insensitive).",
        "Clearing the search query restores the unfiltered view.",
        "Search remains responsive for typical page sizes (no expensive per-keystroke recomputation beyond simple in-memory filtering)."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Generate and add a cartoonish old-camera favicon as a static frontend asset, and wire it into the app HTML so browsers display it as the site favicon.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Can you just have a picture of the old camera cartoonish like to use for the Favicom?",
          "I trust you to generate one. It doesn't have to be wonderful and not picky. Just something."
        ]
      },
      "acceptanceCriteria": [
        "A generated old-camera icon image is added under frontend/public/assets/generated/ and referenced by frontend/index.html via an appropriate <link rel=\"icon\" ...> tag.",
        "The favicon loads successfully in the browser (no 404) and appears in the browser tab for the app.",
        "No backend routing is introduced for the favicon (static asset only)."
      ]
    },
    {
      "id": "REQ-32",
      "text": "Create a project checkpoint document named PHOTO_APP_STAGE_3_SEARCH after implementing search, captions, and favicon end-to-end.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create checkpoint PHOTO_APP_STAGE_3_SEARCH when done."
        ]
      },
      "acceptanceCriteria": [
        "A new checkpoint file named frontend/PHOTO_APP_STAGE_3_SEARCH.checkpoint.md exists.",
        "The checkpoint summarizes the shipped Search + Captions + Favicon changes (frontend + backend) and any relevant API additions.",
        "The app builds and the full flow works: upload photos, edit captions in viewer, and search filters by caption/name and album name."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text.",
    "No AI features.",
    "Search must be local-only: filter already-loaded photos/albums; do not add server-side search APIs.",
    "Respect Internet Identity auth and existing per-user access controls.",
    "Backend must remain single-actor (all Motoko logic in backend/main.mo); add/update backend/migration.mo only if required for safe upgrades.",
    "Do not edit files under frontend/src/components/ui or any other immutable frontend paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not implement semantic/AI search, tagging, OCR, or image analysis.",
    "Do not implement full-text indexing or any separate backend search storage.",
    "Do not add new organization concepts beyond existing albums (no tags, smart albums, etc.).",
    "Do not change upload behavior beyond including/storing the caption field in returned photo metadata if needed."
  ],
  "imageRequirements": {
    "required": [
      "Cartoonish old camera icon with simple bold outlines and minimal shading, transparent background (favicon-old-camera.dim_512x512.png)"
    ],
    "edits": []
  }
}