{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Accumulative pending upload selection with pre-upload previews",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Accumulate selected images into a pending upload list across multiple picker selections and show thumbnails before uploading.",
      "acceptanceCriteria": [
        "When the user selects images from the file picker, the app shows thumbnail previews for all currently pending images (including those selected in earlier picker sessions).",
        "Selecting additional images later adds them to the pending preview list rather than replacing the previous pending previews.",
        "The user can clearly see how many photos are pending before upload, and the UI remains mobile-first and minimal.",
        "All user-facing text related to this flow is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/UploadButton.tsx",
          "operation": "modify",
          "description": "Refactor the component from immediate-upload-on-select into a two-step flow: (1) selecting images appends them into an in-memory pending list, (2) UI renders a minimal, mobile-first preview strip/grid of all pending images plus a clear pending count in English. Ensure multiple file-picker sessions append rather than replace, and reset the underlying file input value after each selection so re-selecting the same file still triggers onChange. Use object URLs (URL.createObjectURL) for previews and revoke them on clear/unmount to avoid leaks. Use the blob-storage component's ExternalBlob only at the upload step (not for previews) and verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/PendingUploadPreview.tsx",
          "operation": "create",
          "description": "Add a small presentational component to render pending image thumbnails and a pending-count label (English), optimized for mobile-first layouts. Keep it purely UI-focused and composed into UploadButton (no direct backend calls). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Upload only the current pending selection, clear pending previews on success, keep pending on failure, and preserve existing gallery UI.",
      "acceptanceCriteria": [
        "After a successful upload, the pending preview list is cleared and the gallery grid still shows all photos that were previously uploaded plus the new ones.",
        "After a failed upload, the pending preview list remains intact so the user can retry without re-selecting files, and the existing gallery remains unchanged.",
        "Uploading multiple times in a row (select → upload → select → upload) only ever increases the stored photo count unless the user explicitly deletes photos via the existing Delete action.",
        "The existing basic upload failure message behavior remains (English), and no new error messaging is introduced that contradicts it."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/UploadButton.tsx",
          "operation": "modify",
          "description": "Implement an explicit Upload action that uploads exactly the current pending selection (convert only pending files to Photo objects and ExternalBlob instances at click time). On success: clear pending state, clear previews, clear progress, and keep the existing onError behavior untouched (no new conflicting messaging). On failure: preserve pending list and previews so the user can retry; keep existing 'Upload failed. Please try again.' behavior (English) and do not clear pending. Ensure the component disables upload while isPending and shows progress without mutating or clearing the existing gallery list. Verify the blob-storage component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the upload mutation continues to invalidate/refetch the existing photo list query after a successful upload (so newly uploaded photos appear in the grid without removing existing ones). Keep failure behavior unchanged (no additional user-facing messaging added here)."
        },
        {
          "path": "frontend/src/screens/HomeScreen.tsx",
          "operation": "modify",
          "description": "Confirm the HomeScreen continues to treat uploads as additive by relying on existing paginated photo queries and not clearing photo state on upload. If needed, adjust only wiring/props for any UploadButton UI changes while keeping the current error banner and its English text behavior unchanged."
        }
      ]
    }
  ]
}