{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Simple Albums UI (tabs, album list, album grid detail, add/remove photos)",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Add an Albums tab alongside the Library view in the authenticated UI, keeping the experience mobile-first and English-only.",
      "acceptanceCriteria": [
        "The signed-in experience provides a clear way to switch between the main Library view and a new Albums view (e.g., tabs/segmented control).",
        "All user-facing labels, buttons, and messages added for Albums are in English.",
        "Existing Library behavior (upload, grid, viewer, delete) remains accessible and unchanged when on the Library tab."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/HomeScreen.tsx",
          "operation": "modify",
          "description": "Add a simple Library/Albums tab switch within the authenticated screen, preserving the existing Library UI and behaviors when Library is selected. Use the authorization component’s frontend guidance to ensure the tabbed content is only shown when authenticated and cached data stays cleared on logout (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/screens/AlbumsScreen.tsx",
          "operation": "create",
          "description": "Create an Albums screen component rendered by the new Albums tab; keep layout mobile-first and all text in English."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Implement Albums list UI with cover thumbnails and album management (create, rename, delete) using React Query updates.",
      "acceptanceCriteria": [
        "Albums view shows a list/grid of albums; each album card shows a cover thumbnail (derived from album contents) and the album name.",
        "If an album has no photos, the UI shows a simple empty cover placeholder.",
        "Users can create a new album by entering an album name.",
        "Users can rename an existing album by editing its name.",
        "Users can delete an album with a basic confirmation step to prevent accidental deletion.",
        "After create/rename/delete, the albums list updates immediately (via React Query invalidation/refetch)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for albums: listAlbums, createAlbum, renameAlbum, deleteAlbum, and minimal cover-photo fetching based on existing backend capabilities. Ensure mutations invalidate/refetch album-related query keys for immediate UI updates."
        },
        {
          "path": "frontend/src/screens/AlbumsScreen.tsx",
          "operation": "modify",
          "description": "Render a simple albums grid/list with album name and cover thumbnail. Cover derivation: if album has photoIds, fetch a cover photo (e.g., first photoId) via existing backend capability; otherwise show an empty placeholder. Provide create/rename/delete UI with English labels and a basic delete confirmation."
        },
        {
          "path": "frontend/src/components/AlbumCard.tsx",
          "operation": "create",
          "description": "Add an AlbumCard component used by AlbumsScreen to display album name and cover (using blob-storage ExternalBlob.getDirectURL() for cover rendering where available; Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/AlbumActionsDialog.tsx",
          "operation": "create",
          "description": "Add a small dialog/modal component to support create and rename (text input) and delete confirmation, keeping UI simple and English-only."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Implement album detail view with a photo grid, pagination, and add/remove photo membership while keeping photos in the main Library.",
      "acceptanceCriteria": [
        "Tapping an album opens an album detail view that renders photos in a grid using the app’s existing grid/viewer patterns.",
        "Users can add photos to an album from their library without removing them from the main Library grid.",
        "Users can remove photos from the album without deleting the photos from the main Library.",
        "Album grid supports loading more if pagination is required by the backend.",
        "After add/remove operations, the album grid and album cover update appropriately (via React Query invalidation/refetch)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for album detail: getAlbum (metadata), getAlbumPhotosPaginated (infinite query), addPhotosToAlbum (mutation), removePhotoFromAlbum (mutation). Ensure add/remove invalidates album photos queries and album list/cover queries so grids and covers update."
        },
        {
          "path": "frontend/src/screens/AlbumDetailScreen.tsx",
          "operation": "create",
          "description": "Create an album detail view that shows an album header (name + back) and a paginated photo grid for the album. Reuse existing PhotoGrid and PhotoViewer patterns for viewing. Add a simple 'Add photos' action that opens a picker from the user’s Library."
        },
        {
          "path": "frontend/src/screens/AlbumsScreen.tsx",
          "operation": "modify",
          "description": "Wire album selection to open AlbumDetailScreen (e.g., local state navigation within the Albums tab). Ensure there are no orphan views and users can navigate back to the albums list."
        },
        {
          "path": "frontend/src/components/AlbumPhotoGridItem.tsx",
          "operation": "create",
          "description": "Add a small wrapper for album grid thumbnails that supports a 'Remove' affordance per photo (removes membership only). Use blob-storage ExternalBlob.getDirectURL() for thumbnail rendering (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/PhotoPickerDialog.tsx",
          "operation": "create",
          "description": "Add a simple modal to select one-or-more photos from the main Library (using already-fetched library pages when possible) and add them to the album. Keep it simple and mobile-first with English-only labels."
        },
        {
          "path": "frontend/src/screens/HomeScreen.tsx",
          "operation": "modify",
          "description": "Ensure the Library tab remains unchanged in behavior and accessible; if the Albums tab needs access to the user’s library list for the picker, reuse existing photo queries without altering the Library grid/viewer/delete flows."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Add a project checkpoint marker for PHOTO_APP_STAGE_2_ALBUMS once Albums UI is integrated end-to-end.",
      "acceptanceCriteria": [
        "A checkpoint named PHOTO_APP_STAGE_2_ALBUMS exists and corresponds to a build where Albums works end-to-end (backend + frontend)."
      ],
      "file_operations": [
        {
          "path": "frontend/PHOTO_APP_STAGE_2_ALBUMS.checkpoint.md",
          "operation": "create",
          "description": "Create a checkpoint marker file documenting that PHOTO_APP_STAGE_2_ALBUMS corresponds to the Albums feature being implemented and wired into the authenticated UI."
        }
      ]
    }
  ]
}