{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Local Home search, per-photo captions in viewer, and generated favicon",
  "requirements": [
    {
      "id": "REQ-29",
      "summary": "Add an editable caption field to the full-screen PhotoViewer and persist updates via backend, updating UI and caches.",
      "acceptanceCriteria": [
        "PhotoViewer shows a caption field for the currently viewed photo with clear English labeling (e.g., \"Caption\").",
        "User can edit the caption and save; a loading/disabled state is shown during save, and failures show a simple English error message.",
        "On successful save, the viewer displays the updated caption for the photo without requiring a full page refresh.",
        "Relevant React Query caches are invalidated/updated so the Home grid data used for local search reflects the new caption (e.g., invalidate ['allPhotos'] and any per-photo query keys used)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query mutation hook that calls the backend capability to update (set/clear) a photo caption, and on success invalidate/update relevant caches (at minimum ['allPhotos'] and any ['photo', photoId] queries)."
        },
        {
          "path": "frontend/src/components/PhotoViewer.tsx",
          "operation": "modify",
          "description": "Add a labeled caption editor UI (input/textarea) for the current photo, with Save and Clear actions; wire to the update caption mutation; show loading/disabled state during save and a simple English error message on failure; update local viewer state to reflect the saved caption immediately and invalidate/update React Query caches so Home local search reflects the change."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Add a fast, local-only Home header search bar that filters already-loaded photos/albums in-memory per active tab.",
      "acceptanceCriteria": [
        "Home screen renders a search input in the authenticated experience with English placeholder text (e.g., \"Search\").",
        "Search filtering is local-only (no new backend search endpoints) and operates on the currently loaded pages of photos/albums.",
        "Library tab: photo grid updates to only show photos whose caption or name/filename contains the search query (case-insensitive).",
        "Albums tab: album list updates to only show albums whose name contains the search query (case-insensitive).",
        "Clearing the search query restores the unfiltered view.",
        "Search remains responsive for typical page sizes (no expensive per-keystroke recomputation beyond simple in-memory filtering)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/HomeScreen.tsx",
          "operation": "modify",
          "description": "Add a controlled search input to the Home header (authenticated experience) with English placeholder text; maintain searchQuery state; implement case-insensitive in-memory filtering of already-loaded photo pages for the Library tab (match against caption and name/filename) using memoization; ensure clearing query restores the unfiltered view; ensure PhotoViewer receives the filtered photo list when a search is active and handle index/range changes safely when the filter changes."
        },
        {
          "path": "frontend/src/screens/AlbumsScreen.tsx",
          "operation": "modify",
          "description": "Accept a searchQuery prop from Home and filter the already-loaded albums list locally by album name (case-insensitive); ensure clearing the query restores the full album list and keep UI text in English."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Add a generated cartoon old-camera favicon as a static asset and wire it into index.html.",
      "acceptanceCriteria": [
        "A generated old-camera icon image is added under frontend/public/assets/generated/ and referenced by frontend/index.html via an appropriate <link rel=\"icon\" ...> tag.",
        "The favicon loads successfully in the browser (no 404) and appears in the browser tab for the app.",
        "No backend routing is introduced for the favicon (static asset only)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/favicon-old-camera.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated favicon image asset (transparent background) at exactly frontend/public/assets/generated/favicon-old-camera.dim_512x512.png."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Wire the generated favicon into the app HTML by adding an appropriate favicon link tag referencing frontend/public/assets/generated/favicon-old-camera.dim_512x512.png so it loads as a static asset (no backend routing)."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Create a stage 3 checkpoint document summarizing Search + Captions + Favicon end-to-end.",
      "acceptanceCriteria": [
        "A new checkpoint file named frontend/PHOTO_APP_STAGE_3_SEARCH.checkpoint.md exists.",
        "The checkpoint summarizes the shipped Search + Captions + Favicon changes (frontend + backend) and any relevant API additions.",
        "The app builds and the full flow works: upload photos, edit captions in viewer, and search filters by caption/name and album name."
      ],
      "file_operations": [
        {
          "path": "frontend/PHOTO_APP_STAGE_3_SEARCH.checkpoint.md",
          "operation": "create",
          "description": "Create the checkpoint document summarizing the implemented Home local search, PhotoViewer caption editing (including cache invalidation behavior), and favicon wiring; include a brief note about the backend capability relied on (e.g., caption update method) while keeping this as documentation only."
        }
      ]
    }
  ]
}